import {
    parseTableTextWithHeaders,
} from "./utils";

const 호남선_raw = {
    text:
        `401	KTX_산천			5:08	5:25		5:55	6:11				6:30		6:47		7:08		7:41	매일
403	KTX_산천			5:48	6:05	6:28	6:40					7:09		7:26		7:47	7:57	8:25	매일
471	KTX_산천			6:10	6:27	6:50	7:02		7:21	7:37	7:55	8:18							매일
405	KTX	6:00	6:21	6:29	6:46		7:16	7:32				7:51		8:08		8:29	8:39	9:06	매일
473	KTX		6:45	6:53	7:11	7:33	7:46		8:03										매일
441	KTX			7:38	7:55		8:25					8:54				9:24			매일
407	KTX-산천	7:18	7:39	7:47	8:05			8:46				9:05		9:22		9:43	9:53	10:20	매일
409	KTX			8:20		8:55	9:07					9:36		9:53		10:14	10:24	10:51	매일
411	KTX			9:19	9:36		10:06					10:35				11:05			매일
475	KTX_산천			9:44	10:02	10:25			10:52	11:07	11:25	11:52	12:04	12:20	12:38	12:52	13:03	13:31	매일
413	KTX		10:32	10:40		11:15	11:27					11:56		12:13		12:34	12:44	13:11	매일
415	KTX-산천	11:47	12:08	12:18	12:35	12:58		13:22				13:41				14:13	14:23	14:50	매일
417	KTX_산천	12:17		12:45			13:27	13:43				14:02		14:19		14:40		15:13	매일
9419	KTX-산천			13:30	13:47	14:10						14:46		15:03		15:24	15:34	16:01	월화수목
419	KTX-산천			13:30	13:47	14:10						14:46		15:03		15:24	15:34	16:01	매일
4041	KTX_산천			14:38	14:56	15:18	15:31		15:49	16:05	16:23	16:48		17:05		17:26	17:36	18:03	금토일
421	KTX			14:48	15:05	15:28	15:40					16:09		16:26		16:47		17:20	매일
423	KTX			15:33	15:50		16:20	16:37				16:56		17:13		17:34	17:44	18:11	금토일
425	KTX-청룡			16:08								17:14				17:44			월화수목
491	KTX			16:08								17:14				17:44			금토일
427	KTX-산천		16:35	16:43	17:00	17:23		17:47				18:06		18:23		18:44	18:54	19:21	매일
481	KTX			17:10	17:28				18:11	18:27	18:45	19:10	19:22	19:37	19:56	20:10	20:21	20:49	매일
429	KTX_산천		17:37	17:44			18:26	18:42				19:01				19:33	19:43	20:10	매일
483	KTX			17:48		18:23			18:48										매일
431	KTX			18:31	18:49	19:12	19:24					19:53		20:10		20:29			매일
433	KTX		19:29	19:41	19:59		20:28	20:45				21:04		21:21		21:42	21:52	22:19	매일
435	KTX-산천			20:33	20:50	21:13	21:25					21:54		22:11		22:32	22:42	23:09	매일
485	KTX_산천			21:09	21:27	21:49			22:16	22:31	22:49	23:13							매일
437	KTX			21:18	21:35			22:18				22:37				23:09	23:19	23:46	매일
439	KTX	21:57		22:23	22:41	23:03	23:16					23:45		0:02		0:21			매일`,
    headers: [
        "열차번호",
        "편성",
        "행신",
        "서울",
        "용산",
        "광명",
        "천안아산",
        "오송",
        "공주",
        "서대전",
        "계룡",
        "논산",
        "익산",
        "김제",
        "정읍",
        "장성",
        "광주송정",
        "나주",
        "목포",
        "비고",
    ],
};

const 전라선_raw = {
    text:
        `501	KTX_산천			5:08	5:25		5:55	6:11				6:33	6:50	7:17			7:48	8:02	8:10	매일
503	KTX	6:41	7:03	7:10	7:27	7:50	8:02	8:19				8:39	8:56	9:23		9:41	9:57	10:11	10:19	금토일
4051	KTX_산천	7:18	7:39	7:47	8:05			8:46				9:08	9:25	9:52			10:23	10:37	10:45	금토일
581	KTX			7:43	8:01				8:44	9:00	9:18	9:42	9:59	10:27	10:37		11:01	11:15	11:23	월화수목
505	KTX			8:40	8:58		9:27	9:44				10:03	10:20	10:47	10:57	11:08	11:24	11:38	11:46	매일
507	KTX_산천	9:24	9:45	9:53	10:11	10:34	10:46	11:03				11:23	11:40	12:07	12:17		12:41	12:55	13:03	매일
9507	KTX-산천	9:24	9:45	9:53	10:11	10:34	10:46	11:03				11:23	11:40	12:07	12:17		12:41	12:55	13:03	금토일
585	KTX			10:04	10:22	10:44			11:11	11:26	11:44	12:09	12:25							매일
509	KTX			10:53	11:10	11:33	11:45	12:02				12:21	12:37	13:04		13:23	13:39	13:53	14:01	매일
511	KTX-산천	11:47	12:08	12:18	12:35	12:58		13:22				13:44	14:01	14:28	14:38		15:02		15:21	매일
543	KTX_산천	12:17		12:45			13:27	13:43				14:05	14:22	14:49			15:21	15:35	15:43	월화수목토일
587	KTX_산천			12:11	12:29	12:53			13:19	13:34	13:51	14:16	14:32							매일
589	KTX			13:15	13:32	13:55			14:21	14:36	14:54	15:19	15:35							금토일
513	KTX			14:10	14:28		14:57	15:14				15:32	15:49	16:16			16:48	17:02	17:10	매일
583	KTX-산천			14:38	14:56	15:18	15:31		15:49	16:05	16:23	16:48	17:05	17:32		17:50	18:06	18:20	18:28	월화수목
593	KTX-산천			14:38	14:56	15:18	15:31		15:49	16:05	16:23	16:51	17:07	17:34		17:53	18:08	18:22	18:30	금토일
515	KTX_산천		16:35	16:43	17:00	17:23		17:47				18:11	18:28	18:55	19:05	19:16	19:32	19:46	19:54	매일
517	KTX_산천		17:37	17:44			18:26	18:42				19:04	19:21	19:48			20:19	20:33	20:42	매일
519	KTX_산천	18:21		18:48	19:05	19:28		19:52				20:11	20:27	20:54		21:13	21:29	21:43	21:51	매일
521	KTX			20:08	20:26	20:48	21:01					21:30	21:46	22:13	22:23		22:47	23:01	23:09	매일
541	KTX-산천			20:33	20:50	21:13	21:25					21:57	22:14	22:41			23:12	23:26	23:35	매일
523	KTX_산천			21:48	22:05							22:58	23:15	23:42			0:13	0:27	0:35	매일`,
    headers: [
        "열차번호",
        "편성",
        "행신",
        "서울",
        "용산",
        "광명",
        "천안아산",
        "오송",
        "공주",
        "서대전",
        "계룡",
        "논산",
        "익산",
        "전주",
        "남원",
        "곡성",
        "구례구",
        "순천",
        "여천",
        "여수엑스포",
        "비고",
    ],
};

function parseTimetable(row: Record<string, string>, headers: string[]) {
    const stops = headers.slice(2, -1);
    const stopsWithTime = stops.map((stop) => ({
        station: stop,
        time: row[stop],
    })).filter((stop) => stop.time !== "");

    const departureStop = stopsWithTime[0];
    const arrivalStop = stopsWithTime[stopsWithTime.length - 1];

    const trainName = row["편성"].replaceAll("_", "-");
    const trainNumber = row["열차번호"];

    const runningDay = parseRunningDay(row["비고"]);

    return {
        departure: departureStop,
        arrival: arrivalStop,
        trainName,
        trainNumber,
        runningDay,
    };
}

function parseRunningDay(text: string) {
    if (text === "매일") {
        return [1, 2, 3, 4, 5, 6, 7];
    }

    const koreanDays = ["월", "화", "수", "목", "금", "토", "일"];
    return text.split("").map((day) => {
        return koreanDays.indexOf(day) + 1;
    });
}

const 호남선_timetable = parseTableTextWithHeaders(
    호남선_raw.text,
    호남선_raw.headers,
).map((row) => ({
    ...parseTimetable(row, 호남선_raw.headers),
    mainline: "호남선",
}));

const 전라선_timetable = parseTableTextWithHeaders(
    전라선_raw.text,
    전라선_raw.headers,
).map((row) => ({
    ...parseTimetable(row, 전라선_raw.headers),
    mainline: "전라선",
}));

const timetable = [
    ...호남선_timetable,
    ...전라선_timetable,
];

console.log(JSON.stringify(timetable, null, 4))
